# Groupby Methods
This method groups our rows.

In [1]:
import numpy as np
import pandas as pd

In [5]:
salaryDict = {"Departman":["Software","Software","Marketing","Marketing","HR","HR"],
             "Employee":["Ömer","Yusuf","Merve","Şeyma","Deniz","Fatma"],
             "Salaries":[1,2,3,4,5,6]}

In [6]:
salaryDataFrame = pd.DataFrame(salaryDict)
salaryDataFrame

   Departman Employee  Salaries
0   Software     Ömer         1
1   Software    Yusuf         2
2  Marketing    Merve         3
3  Marketing    Şeyma         4
4         HR    Deniz         5
5         HR    Fatma         6

In [10]:
tempData=salaryDataFrame.groupby("Departman")
tempData

=> tempData.  You can see what you can do when you click the tab.

In [13]:
tempData.count()  # how many people work in departmans

           Employee  Salaries
Departman
HR                2         2
Marketing         2         2
Software          2         2

In [14]:
tempData.mean()  # avarege of salaries

           Salaries
Departman
HR              5.5
Marketing       3.5
Software        1.5

In [15]:
tempData.min()

          Employee  Salaries
Departman
HR           Deniz         5
Marketing    Merve         3
Software     Yusuf         1

In [16]:
tempData.max()

          Employee  Salaries
Departman
HR           Fatma         6
Marketing    Şeyma         4
Software      Ömer         2

In [17]:
tempData.describe()

          Salaries
             count mean       std  min   25%  50%   75%  max
Departman
HR             2.0  5.5  0.707107  5.0  5.25  5.5  5.75  6.0
Marketing      2.0  3.5  0.707107  3.0  3.25  3.5  3.75  4.0
Software       2.0  1.5  0.707107  1.0  1.25  1.5  1.75  2.0